In [ ]:
import pandas as pd 
import numpy as np
k= np.random.randint(1,30, size = (5,3))
df = pd.DataFrame(k, columns = ["met1","met2","met3"])
df

df.index = ["a","b","c","d","e"]
df

In [9]:
df2= df +100
df2

   met1  met2  met3
a   108   114   120
b   122   124   124
c   122   116   129
d   125   122   126
e   103   103   128

In [12]:
pd.concat([df,df2])  #JOIN İŞLEMİ concat fonksiyonu ile yapılır

   met1  met2  met3
a     8    14    20
b    22    24    24
c    22    16    29
d    25    22    26
e     3     3    28
a   108   114   120
b   122   124   124
c   122   116   129
d   125   122   126
e   103   103   128

In [13]:
?pd.concat

Signature:
pd.concat(
    ['objs', 'axis=0', "join='outer'", 'join_axes=None', 'ignore_index=False', 'keys=None', 'levels=None', 'names=None', 'verify_integrity=False', 'sort=None', 'copy=True'],
)
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series, DataFrame, or Panel objects
    If a dict is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis(es)
join_axes : list of Index objects
    Specific indexes to use for the other n - 1 axes instead of performing
    inner/outer set logic
ignore_index : boolean, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys
names : list, default None
    Names for the levels in the resulting hierarchical index
verify_integrity : boolean, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation
sort : boolean, default None
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'. The current default of sorting is deprecated and will
    change to not-sorting in a future version of pandas.

    Explicitly pass ``sort=True`` to silence the warning and sort.
    Explicitly pass ``sort=False`` to silence the warning and not sort.

    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0

copy : boolean, default True
    If False, do not copy data unnecessarily

Returns
-------
concatenated : object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<http://pandas.pydata.org/pandas-docs/stable/merging.html>`__.

See Also
--------
Series.append
DataFrame.append
DataFrame.join
DataFrame.merge

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2',])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3])
  animal letter  number
0    NaN      a       1
1    NaN      b       2
0    cat      c       3
1    dog      d       4

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\programdata\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [17]:
pd.concat([df,df2], ignore_index=True)  #Yukarıdaki index hatasını düzeltmek için 'ignore_index=true' fonksiyonunu kullanırız
#abcde gitti. yerine 0 dan 9 a kadar index no ları geldi.

   met1  met2  met3
0     8    14    20
1    22    24    24
2    22    16    29
3    25    22    26
4     3     3    28
5   108   114   120
6   122   124   124
7   122   116   129
8   125   122   126
9   103   103   128

In [18]:
#EGER COLUMS LARDA FARKLILIK VARSA JOIN İSLEMİ BASSRILI OLABİLİR AMA AYNI CESİT DEGERİ TASIMAYANLAR HATALI CIKTI VERİR
#AŞAGIDAKİ İŞLEMLERDE  GÖZLEMLENEN HATALAR VE DÜELTME YÖNTEMLERİNE DİKKAT EDİNİZ.

In [21]:
df2.columns = ["met1","met2", "MAT1"]
df2

   met1  met2  MAT1
a   108   114   120
b   122   124   124
c   122   116   129
d   125   122   126
e   103   103   128

In [23]:
pd.concat([df,df2]) # işte tamda burada aşagıdaki gibi bir hata NaN hatası var bunun düzeltilmesi lazım..'inner joın'

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    MAT1  met1  met2  met3
a    NaN     8    14  20.0
b    NaN    22    24  24.0
c    NaN    22    16  29.0
d    NaN    25    22  26.0
e    NaN     3     3  28.0
a  120.0   108   114   NaN
b  124.0   122   124   NaN
c  129.0   122   116   NaN
d  126.0   125   122   NaN
e  128.0   103   103   NaN

In [27]:
pd.concat([df,df2] , ignore_index=True, join = "inner") # HER İKİ dATAFRAMDE Kİ KESİMLERİ ALDIKK..

   met1  met2
0     8    14
1    22    24
2    22    16
3    25    22
4     3     3
5   108   114
6   122   124
7   122   116
8   125   122
9   103   103

In [36]:
pd.concat([df,df2] , ignore_index=True, join_axes = [df.columns]) # burada df nin columlarını sabit tututp df2 nin farklı olaan
  #columnunu df nin devamına yazmıs olduk

   met1  met2  met3
0     8    14  20.0
1    22    24  24.0
2    22    16  29.0
3    25    22  26.0
4     3     3  28.0
5   108   114   NaN
6   122   124   NaN
7   122   116   NaN
8   125   122   NaN
9   103   103   NaN

pd.concat([df,df2] , ignore_index=True, join_axes = [df.columns]) # burada df nin columlarını sabit tututp df2 nin farklı olaan
  #columnunu df nin devamına yazmıs olduk